app/Controllers/EquipmentController.php

INSERT INTO `logs` (`action`, `item_id`, `user`, `timestamp`) VALUES ('Add', 0, 'admin', '2024-12-01 15:40:07')
---
    private function logAction($action, $itemId, $user) {
        // Create a log entry
        $this->logModel->insert([
            'action' => $action,
            'item_id' => $itemId,
            'user' => $user,
            'timestamp' => date('Y-m-d H:i:s')
        ]);

SELECT *
FROM `item`
WHERE   (
`CATEGORY` LIKE '%sus%' ESCAPE '!'
OR  `NAME` LIKE '%sus%' ESCAPE '!'
OR  `STATUS` LIKE '%sus%' ESCAPE '!'
OR  `UNIQUEID` LIKE '%sus%' ESCAPE '!'
OR  `ID` LIKE '%sus%' ESCAPE '!'
 )
 LIMIT 8
SELECT COUNT(*) AS `numrows`
FROM `item`
WHERE   (
`CATEGORY` LIKE '%sus%' ESCAPE '!'
OR  `NAME` LIKE '%sus%' ESCAPE '!'
OR  `STATUS` LIKE '%sus%' ESCAPE '!'
OR  `UNIQUEID` LIKE '%sus%' ESCAPE '!'
OR  `ID` LIKE '%sus%' ESCAPE '!'
 )
SELECT `ID`, COUNT(*) as total
FROM `item`
WHERE `STATUS` = 'Available'
GROUP BY `ID`
---
    public function index() {
        if (!session()->has('isLoggedIn')) {
            return redirect()->to('login');
        }

        // Load models
        $itemModel = model('Equipment_model');
        $search = $this->request->getGet('search');

        // Apply search conditions
        if ($search) {
            $itemModel->groupStart()
                        ->like('CATEGORY', $search)
                        ->orLike('NAME', $search)
                        ->orLike('STATUS', $search)
                        ->orLike('UNIQUEID', $search)
                        ->orLike('ID', $search)
                        ->groupEnd();
        }

        // Pagination and data retrieval
        $data['items'] = $itemModel->paginate(8);
        $data['pager'] = $itemModel->pager;
        $data['search'] = $search;
        $data['title'] = "Equipment Manager";

        $data['categoryCounts'] = $itemModel->select('ID, COUNT(*) as total')
                        ->where('STATUS', 'Available')
                        ->groupBy('ID')
                        ->findAll();

SELECT *
FROM `item`
WHERE `CATEGORY` = 'Speaker'
ORDER BY `UNIQUEID` DESC
 LIMIT 1
---
            }

            // Query the database for the highest UNIQUEID in the selected category
            $lastItem = $itemmodel->where('CATEGORY', $category)
                ->orderBy('UNIQUEID', 'DESC')
                ->first();

INSERT INTO `item` (`CATEGORY`, `NAME`, `ID`, `UNIQUEID`, `IMAGE`, `STATUS`) VALUES ('Speaker', 'asus', 'SPKR', 'SPKR004', 'asus.png', 'Available')
---
            ];

            // Insert into the database
            if (!$itemmodel->insert($itemdata)) {

SELECT *
FROM `item`
WHERE `UNIQUEID` = 'SPKR004'
 LIMIT 1
---
    public function view($UNIQUEID){
        // Load the model
        $itemmodel = model('Equipment_model');

        // Retrieve the data from the table
        $data['item'] = $itemmodel->where('UNIQUEID', $UNIQUEID)->first();